tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# TIFF library and utilities
brew "libtiff"
# Collection of portable C++ source libraries
brew "boost"
# Atmel AVR MCU programmer
brew "avrdude"
# Magical shell history
brew "atuin"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# PR-style review loop for AI agent output (crit.md) — review diffs/plans/UI locally
brew "crit"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Modern, maintained replacement for ls
brew "eza"
# OpenType text shaping engine
brew "harfbuzz"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Command-line tool to show clear git graphs arranged for your branching model
brew "git-graph"
# Git extension for versioning large files
brew "git-lfs"
# Development kit for the Java programming language
brew "openjdk"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# World's fastest and most advanced password recovery utility
brew "hashcat"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Featureful UNIX password cracker
brew "john"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Statically typed programming language for the JVM
brew "kotlin"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Simple terminal UI for git commands
brew "lazygit"
# Library for complex text layout
brew "libraqm"
# Rainbows and unicorns in your console!
brew "lolcat"
# Java-based project management
brew "maven"
# Modern and intuitive terminal-based text editor
brew "micro"
# Dev tool version manager
brew "mise"
# Open source relational database management system
brew "mysql", restart_service: :changed
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Classic snake game with textual interface
brew "nsnake"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PNG image optimizing utility
brew "pngquant"
# Object-relational database system
brew "postgresql@14"
# Theme for zsh
brew "powerlevel10k"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Rust toolchain installer
brew "rustup"
# Display and control your Android device
brew "scrcpy"
# CLI and dbus interface for WhisperSystems/libsignal-service-java
brew "signal-cli"
# Plugin manager for zsh
brew "sheldon"
# Editor of encrypted files
brew "sops"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Vi 'workalike' with many additional features
brew "vim"
# Yet Another Dotfiles Manager
brew "yadm"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust
brew "yazi"
# Command-line interface for 1Password
cask "1password-cli"
# Android SDK component
cask "android-platform-tools"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Universal database tool and SQL client
cask "dbeaver-community"
# App to build, share, and run containerized applications
cask "docker-desktop"
# Disk usage utility
cask "disk-inventory-x"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-sf-mono"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar manager
cask "jordanbaird-ice"
# Visual diff and merge tool
cask "meld"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
vscode "anthropic.claude-code"
vscode "charliermarsh.ruff"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "opentofu.vscode-opentofu"
vscode "ryanluker.vscode-coverage-gutters"
vscode "wholroyd.jinja"
